In [9]:
import pandas as pd
pd.__version__

'1.5.3'

In [10]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [11]:
df = pd.DataFrame()
df["Name"] = ["Jacky Jackson", "Steven Stevenson"]
df["Age"] = [38, 25]
df["Driver"] = [True, False]
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [12]:
new_person = pd.Series(["Molly Mooney", 40, True], index=["Name", "Age", "Driver"])
df.append(new_person, ignore_index=True)

/var/folders/5r/bcxwxb6x521399lvd_5y9jwm0000gn/T/ipykernel_95978/2047773411.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [13]:
df.loc[len(df)]=["Aston Astonson", 24, True]
print(df)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2    Aston Astonson   24    True

In [15]:
data = [['Jacky Jackson', 38, True], ['Steven Stevenson', 25, False]]
df = pd.DataFrame(data=data, columns=['Name', 'Age', 'Driver'])
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [16]:
import numpy as np
data = [['Jacky Jackson', 38, True], ['Steven Stevenson', 25, False]]
matrix = np.array(data)
df = pd.DataFrame(matrix, columns=['Name', 'Age', 'Driver'])
df

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [18]:
data = {"Name" : ["Jacky Jackson", "Steven Stevenson"],
        "Age" : [38, 25],
        "Driver" : [True, False]}
df = pd.DataFrame(data)
df

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [20]:
data = [{"Name" : "Jacky Jackson", "Age" : 38, "Driver" : True},
        {"Name" : "Steven Stevenson", "Age" : 25, "Driver" : False}]
df = pd.DataFrame(data, index=["row_1", "row_2"])
df

                   Name  Age  Driver
row_1     Jacky Jackson   38    True
row_2  Steven Stevenson   25   False

In [21]:
import pandas as pd
data = pd.Series([1,3,6,12])
data

0     1
1     3
2     6
3    12
dtype: int64

In [22]:
data.values

array([ 1,  3,  6, 12])

In [23]:
data2 = pd.Series(np.array([1,3,np.nan,12]))
data3 = pd.Series(["aa", "bb", "c", "d"])
data4 = pd.Series([1, "aa", 2.34, "d"])
print(data2)
print(data3)
print(data4)

0     1.0
1     3.0
2     NaN
3    12.0
dtype: float64
0    aa
1    bb
2     c
3     d
dtype: object
0       1
1      aa
2    2.34
3       d
dtype: object

In [24]:
data5 = pd.Series([1,3,6,12], index=[1,10,20,33])
data6 = pd.Series([1,3,6,12], index=["a","b","c","a"])
data7 = pd.Series({"a":1, "b":3, "c":6, "d":12})
print(data5)
print(data6)
print(data7)

1      1
10     3
20     6
33    12
dtype: int64
a     1
b     3
c     6
a    12
dtype: int64
a     1
b     3
c     6
d    12
dtype: int64

In [25]:
data2.index = ["un", "due", "trois", "quatre"]
data2

un         1.0
due        3.0
trois      NaN
quatre    12.0
dtype: float64

In [26]:
df = pd.DataFrame(np.random.randn(6,2),
                  index=[[1,1,2,2,3,3], [1,2,1,2,1,2]], columns=['item1','item2'])
print(df)

        item1     item2
1 1 -0.770413 -1.737693
  2  2.095566 -1.061110
2 1 -0.820728 -0.012321
  2  0.524800  1.482811
3 1  1.354798 -0.228555
  2  1.297944  0.210822

In [28]:
df.item1[1:2]

1  2    2.095566
Name: item1, dtype: float64

In [29]:
df.loc[3,1]

item1    1.354798
item2   -0.228555
Name: (3, 1), dtype: float64

In [31]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [33]:
df.tail(3)

                  Name PClass   Age   Sex  Survived  SexCode
1310  Zenni, Mr Philip    3rd  22.0  male         0        0
1311  Lievens, Mr Rene    3rd  24.0  male         0        0
1312    Zimmerman, Leo    3rd  29.0  male         0        0

In [34]:
df.shape

(1313, 6)

In [35]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [36]:
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [37]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [38]:
df.loc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [40]:
df.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [41]:
df = df.set_index(df["Name"])
df.loc["Allen, Miss Elisabeth Walton"]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [43]:
df.loc[:'Allison, Miss Helen Loraine', 'Age':'Sex']

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

In [44]:
df[:'Allison, Miss Helen Loraine']

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [46]:
df['Name']

Name
Allen, Miss Elisabeth Walton                                      Allen, Miss Elisabeth Walton
Allison, Miss Helen Loraine                                        Allison, Miss Helen Loraine
Allison, Mr Hudson Joshua Creighton                        Allison, Mr Hudson Joshua Creighton
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Allison, Mrs Hudson JC (Bessie Waldo Daniels)
Allison, Master Hudson Trevor                                    Allison, Master Hudson Trevor
                                                                     ...
Zakarian, Mr Artun                                                          Zakarian, Mr Artun
Zakarian, Mr Maprieder                                                  Zakarian, Mr Maprieder
Zenni, Mr Philip                                                              Zenni, Mr Philip
Lievens, Mr Rene                                                              Lievens, Mr Rene
Zimmerman, Leo                                                                  Zimmerman, Leo
Name: Name, Length: 1313, dtype: object

In [47]:
df[['Age', 'Sex']].head(2)

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

In [49]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)
df[df['Sex'] == 'female'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [50]:
df[(df['Sex']=='female') & (df['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [51]:
df['Name'].str.find('Allison')

0      -1
1       0
2       0
3       0
4       0
       ..
1308   -1
1309   -1
1310   -1
1311   -1
1312   -1
Name: Name, Length: 1313, dtype: int64

In [53]:
df[df['Name'].str.find('Allison')>-1].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [55]:
df['Sex'].replace("female", "Woman").head(5)

0    Woman
1    Woman
2     male
3    Woman
4     male
Name: Sex, dtype: object

In [56]:
df['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [57]:
df.replace(1, "One").head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,One,One
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,One
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,One
4,"Allison, Master Hudson Trevor",1st,0.92,male,One,0

In [58]:
df.replace(r"1st", "First", regex=True).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

In [61]:
df.replace(["female", "male"], "person").head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,person,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,person,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,person,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,person,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,person,1,0

In [62]:
df.replace({"female": 1, "male": 0}).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,1,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,1,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,0,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,1,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,0,1,0

In [64]:
df.rename(columns={'PClass': 'Passenger Class'}).head(5)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [65]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(5)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [66]:
df.columns = ['Name', 'Passeneger Class', 'Age', 'Gender', 'Survived', 'SexCode']

In [67]:
df.rename(index={0:-1}).head(5)

,Name,Passeneger Class,Age,Gender,Survived,SexCode
-1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [68]:
df.index = range(1,1314)

In [70]:
df = pd.read_csv(url)

print(':', df['Age'].max())
print(':', df['Age'].min())
print(':', df['Age'].mean())
print(':', df['Age'].sum())
print(':', df['Age'].count())

: 71.0
: 0.17
: 30.397989417989418
: 22980.88
: 756

In [71]:
df.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [72]:
df.cov()

/var/folders/5r/bcxwxb6x521399lvd_5y9jwm0000gn/T/ipykernel_95978/1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

                 Age  Survived   SexCode
Age       203.320470 -0.430491 -0.382054
Survived   -0.430491  0.225437  0.114070
SexCode    -0.382054  0.114070  0.228230

In [73]:
df.corr()

/var/folders/5r/bcxwxb6x521399lvd_5y9jwm0000gn/T/ipykernel_95978/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

In [74]:
df.sort_values(by='Age', ascending=False)

,Name,PClass,Age,Sex,Survived,SexCode
505,"Mitchell, Mr Henry Michael",2nd,71.0,male,0,0
119,"Goldschmidt, Mr George B",1st,71.0,male,0,0
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0,0
72,"Crosby, Captain Edward Gifford",1st,70.0,male,0,0
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1
...,...,...,...,...,...,...
1300,"Wiseman, Mr Phillippe",3rd,NaN,male,0,0
1302,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1305,"Youssef, Mr Gerios",3rd,NaN,male,0,0
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [75]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [76]:
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [77]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [78]:
df['PClass'].nunique()

4

In [79]:
df.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

In [80]:
df[df['Age'].isnull()].head(5)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

In [81]:
df['Sex'] = df['Sex'].replace('male', np.nan)

In [82]:
df['Sex'] = df['Sex'].replace('male', np.nan)

In [83]:
df = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [84]:
df = pd.read_csv(url, na_values=['female'], 
                        keep_default_na=False)
df[12:14]

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [85]:
df = pd.read_csv(url, na_filter=False)
df[12:14]

                            Name PClass Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st      female         1        1
13      Barkworth, Mr Algernon H    1st        male         1        0

In [86]:
print(df.Age.count())
df.Age.unique()

1313

array(['29.0', '2.0', '30.0', '25.0', '0.92', '47.0', '63.0', '39.0',
       '58.0', '71.0', '19.0', '', '50.0', '24.0', '36.0', '37.0', '26.0',
       '28.0', '45.0', '22.0', '41.0', '48.0', '44.0', '59.0', '60.0',
       '53.0', '33.0', '14.0', '11.0', '49.0', '46.0', '27.0', '31.0',
       '64.0', '55.0', '70.0', '69.0', '38.0', '17.0', '4.0', '23.0',
       '35.0', '54.0', '21.0', '52.0', '16.0', '51.0', '42.0', '40.0',
       '15.0', '65.0', '18.0', '56.0', '43.0', '61.0', '13.0', '34.0',
       '6.0', '57.0', '32.0', '62.0', '67.0', '20.0', '1.0', '12.0',
       '0.83', '8.0', '7.0', '3.0', '0.8', '9.0', '5.0', '0.33', '0.17',
       '10.0', '1.5'], dtype=object)

In [88]:
df = pd.read_csv(url)
df.drop('Age', axis=1).head(5)

,Name,PClass,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,female,1,1
1,"Allison, Miss Helen Loraine",1st,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,female,0,1
4,"Allison, Master Hudson Trevor",1st,male,1,0

In [90]:
df.drop(['Age', 'Sex'], axis=1).head(5)

                                            Name PClass  Survived  SexCode
0                   Allen, Miss Elisabeth Walton    1st         1        1
1                    Allison, Miss Helen Loraine    1st         0        1
2            Allison, Mr Hudson Joshua Creighton    1st         0        0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st         0        1
4                  Allison, Master Hudson Trevor    1st         1        0

In [91]:
df.drop(df.columns[1], axis=1).head(5)

,Name,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",29.00,female,1,1
1,"Allison, Miss Helen Loraine",2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",25.00,female,0,1
4,"Allison, Master Hudson Trevor",0.92,male,1,0

In [93]:
df = pd.read_csv(url)
df[df['Sex'] != 'male'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [94]:
df[df['Name'] != 'Allison, Miss Helen Loraine'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

In [96]:
df[df.index != 0].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

In [98]:
df = pd.read_csv(url)
df.drop_duplicates().head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [99]:
print("   :", len(df))
print("    :", len(df.drop_duplicates()))

   : 1313
    : 1313

In [100]:
df.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [101]:
df.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0